trade_exp/src/DataProcessors/РабочееМестоМенеджераДоставкеНДСБезНДС/РабочееМестоМенеджераДоставкеНДСБезНДС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>РабочееМестоМенеджераДоставкеНДСБезНДС</name>
</mdclass:DataProcessor>

trade_exp/src/AccumulationRegisters/ЗаказыКДоставке/ЗаказыКДоставке.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="81e2ad59-db2f-44b0-bd59-b41113531600">
  <name>ЗаказыКДоставке</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <registerType>Checked</registerType>
  </extension>
  <resources extendedConfigurationObject="b3b4dcbf-350b-46ea-a45e-8818c5c59d21">
    <name>Количество</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <attributes extendedConfigurationObject="07059008-fa97-415d-a41f-dc26d7572867">
    <name>Рейс</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <dimensions extendedConfigurationObject="6e8dc3ce-4050-42cf-b74c-de0160eabf02">
    <name>ЗаказНаДоставку</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="1b3cd544-3144-477d-80f7-3e6b656db96c">
    <name>ДокументПродажи</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:AccumulationRegister>

trade_exp/src/AccumulationRegisters/ЗапасыИПотребности/ЗапасыИПотребности.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="f8b7177a-e10e-497a-870e-8a0109117431">
  <name>ЗапасыИПотребности</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <registerType>Checked</registerType>
  </extension>
  <resources extendedConfigurationObject="2a3239b5-c939-45ab-a821-679e4fe02b0c">
    <name>ВНаличии</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="fa84dffb-fc50-40db-b9e9-2eecc08d3aff">
    <name>Поступит</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="fd2c8e08-d7c5-41b1-a555-e61c7ec66966">
    <name>Заказано</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="63b04ee8-431e-43e1-86d7-a31699fe5f9d">
    <name>РезервироватьНаСкладе</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="7db60568-8a3c-4c91-ad5b-f1c37f1dff6d">
    <name>РезервироватьПоМереПоступления</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="bdd58b52-8895-40cb-9462-86ee07c1a418">
    <name>ОтложитьРезервирование</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="4256427c-6117-4032-b24a-fe3fe80b3479">
    <name>КОбеспечению</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="6ed35275-b9d3-4183-ac57-ab470c9070ce">
    <name>НеОбеспечивать</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <attributes extendedConfigurationObject="f01cba2a-6eee-4608-be77-4081299421fb">
    <name>ЗакрытьГрафикПоступления</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="9fa49e04-61ac-4854-abc9-81a226d49748">
    <name>ЗакрытьГрафикОтгрузки</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="cc3a9a0c-ce39-4e09-95b3-5cf269ade3af">
    <name>ОтгружаемыйЗаказ</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="4de10a7f-26fe-4a6f-9977-b6f11b54f8a7">
    <name>ТипЗаписи</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="ad05a33b-3278-43a0-ab32-a3fbf95febd2">
    <name>Сторно</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <dimensions extendedConfigurationObject="52036866-218a-40f1-b620-3bf0ad8c374a">
    <name>Номенклатура</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="851d8e29-0692-4d7d-bb5f-869fa0f442e4">
    <name>Характеристика</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="4d50d363-128e-4a9e-874f-dcd55a5764b3">
    <name>Склад</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="795b0906-d397-48a6-a53a-d642ad9d07db">
    <name>Назначение</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="294f1bc8-ab72-47b2-ab6b-23004cf40406">
    <name>Заказ</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="6f8a11b2-8bda-4fd8-8728-ed5d380f935a">
    <name>ДатаСобытия</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </dimensions>
</mdclass:AccumulationRegister>

trade_exp/src/Enums/СтатусыЧековККМ/СтатусыЧековККМ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>СтатусыЧековККМ</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues>
    <name>Пробит</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="994ecf6c-34a9-4274-952e-8a44959ddd3d">
    <name>КОплате</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="238e807a-b6d8-401c-b115-0e10b84a16c1">
    <name>ОтложенБезРезервирования</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="b8d448b2-f4c4-4fef-bd83-69bf834a37d5">
    <name>ОтложенСРезервированием</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

trade_exp/src/Enums/ВидыДоставокДоКлиента/ВидыДоставокДоКлиента.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ВидыДоставокДоКлиента</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues extendedConfigurationObject="b4cc6bd2-b207-434d-b027-c3ef416c447c">
    <name>Розничная</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="8cebbe69-bf66-4554-90d5-9fe9e46e6dbf">
    <name>СборнаяОРК</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="4da8f5b7-705c-495c-976b-5d4823a1f879">
    <name>Внутренняя</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="e3544ba3-ce9f-46e6-9877-fa2b4b9656af">
    <name>ДистрибуцияСборныеГрузы</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

trade_exp/src/Enums/СтатусыЗаказовНаДоставку/СтатусыЗаказовНаДоставку.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="001dd93b-cd26-4b28-8ae1-9d7129bc2202">
  <name>СтатусыЗаказовНаДоставку</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues extendedConfigurationObject="1367a921-0ba4-4d75-8d60-7c37522518c2">
    <name>ВРейсе</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

trade_exp/src/Enums/ВариантыОбеспечения/ВариантыОбеспечения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ВариантыОбеспечения</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues extendedConfigurationObject="9b0356bb-5966-4577-ab5a-bbc09ae9323b">
    <name>Отгрузить</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="865e7fe8-0ba5-430f-8819-98ee2644d5c5">
    <name>НеТребуется</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="4ed96c3e-4885-4c35-b010-4d22e1d10826">
    <name>КОбеспечению</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="cd44cebd-862f-40b1-a297-247d05c45d2f">
    <name>СоСклада</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="970e966f-77d3-4ec1-9ca5-f2f5a2a8e2d1">
    <name>РезервироватьПоМереПоступления</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

trade_exp/src/Enums/ВариантыОформленияПродажи/ВариантыОформленияПродажи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ВариантыОформленияПродажи</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues>
    <name>АктНаПередачуПрав</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>РеализацияТоваровУслуг</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>АктВыполненныхРабот</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

trade_exp/src/Enums/ВидыОперацийЛистовСогласования/ВидыОперацийЛистовСогласования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="4e174d0c-fcf4-4edb-b771-d537842fb500">
  <name>ВидыОперацийЛистовСогласования</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues extendedConfigurationObject="0d0f242a-48ae-475d-ad76-05749bd4f77a">
    <name>СогласованиеТранзитов</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="462fe71b-3cb9-4c1c-9888-bdb3e6556265">
    <name>СогласованиеЗадолженности</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="37f89f9f-becc-4e83-9791-d21c6238816b">
    <name>СогласованиеОформления</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

trade_exp/src/Catalogs/ТипыТранспортныхСредств/ТипыТранспортныхСредств.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ТипыТранспортныхСредств</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="23c59cd0-0b4f-43e8-9e11-df2235415bdd">
    <name>Описание</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>1024</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="27f008e6-cf2b-4c20-975b-b8b6311f9c0b">
    <name>ГрузоподъемностьВТоннах</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>9</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="da9b11c4-c49a-4e04-97f1-e1fa0043840a">
    <name>ВместимостьВКубическихМетрах</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>9</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="171e4954-ae22-4673-bf93-30b20c58d1c2">
    <name>ВместимостьПредставление</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="3fcf9894-8f7f-464c-9723-0f750dc365cf">
    <name>Приоритет</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="97597783-195f-413a-a50c-0e028895b40f">
    <name>ДлинаВМетрах</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>9</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <tabularSections extendedConfigurationObject="d9e8da2a-02dd-4613-80be-127a1b644600">
    <name>КритерииЗаказа</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="f6251362-beee-40ca-8024-62fd94bd64db">
      <name>Критерий</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="631ff8c4-8b74-4af9-a5bb-f71c9e848a50">
      <name>Допланирование</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

trade_exp/src/DataProcessors/РабочееМестоМенеджераДоставкеНДСБезНДС/Forms/Форма/Module.bsl
#Область СобытияФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Карта = Истина;
	РежимРаботы = 1;
	ЗаполнитьПериод();
	ИнициализироватьКартуНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПериод()
	Период = ТекущаяДата();
	
	Для Час = 8 По 22 Цикл
		Время = Дата(1,1,1,Час,0,0);
		ФорматВремя = Формат(Время,"ДФ=ЧЧ:мм");
		Элементы.ВремяДоставкиС.СписокВыбора.Добавить(Время, ФорматВремя);
		Элементы.ВремяДоставкиПо.СписокВыбора.Добавить(Время, ФорматВремя);
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьВидимостьДоступность();
	СброситьТС(); 
	ДостуностьТаблицыЗаказов(); 
	СброситьТС();
КонецПроцедуры

&НаКлиенте
Процедура ПулЗаказовПриАктивизацииСтроки(Элемент)
	ТекущаяСтрока= Элементы.ПулЗаказов.ТекущиеДанные;
	Если ТекущаяСтрока <> Неопределено Тогда 
		МассивОснования = ПолучитьМассивОснования(ТекущаяСтрока.ЗаказНаДоставку);
		ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ДокументыПродажи, "Основания", МассивОснования, Истина);
		ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ТоварОснований, "Основания", МассивОснования, Истина);
	Иначе
		РеализацияТоваровУслугПустаяСсылка = ПредопределенноеЗначение("Документ.РеализацияТоваровУслуг.ПустаяСсылка");
		ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ДокументыПродажи, "Основания", РеализацияТоваровУслугПустаяСсылка, Истина);
		ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ТоварОснований, "Основания", РеализацияТоваровУслугПустаяСсылка, Истина);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ДокументыПродажиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ОткрытьЗначение(Элемент.ТекущиеДанные.Ссылка);
КонецПроцедуры

&НаКлиенте 
Процедура ДостуностьТаблицыЗаказов()
	ТипТСВыбран = ПроверитьВыборТС(); 
	Элементы.ДокументыДоставкиОтметка.Доступность = ТипТСВыбран;
	Элементы.Декорация.Видимость = не ТипТСВыбран; 
КонецПроцедуры

&НаСервере
Функция ПроверитьВыборТС() 
	Если ТипТС = Справочники.ТипыТранспортныхСредств.ПустаяСсылка() Тогда 
		Возврат Ложь;
	Иначе
		Возврат Истина;
	КонецЕсли; 
КонецФункции

&НаКлиенте
Процедура ПулЗаказовОтметкаПриИзменении(Элемент)
	Если не ПроверитьВыборТС() Тогда 
		Сообщить("Не выбран тип ТС!"); 
	КонецЕсли; 
	Попытка
		ДобавитьУдалитьЗаказВРейс();
	Исключение
		Сообщить("Ошибка сервиса геокодирования Яндекс");
	КонецПопытки;	
КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииДанныхДляДоставки()
	ОбновитьСписокДоставкиНаСервере();
	УстановитьВидимостьДоступность();
	ОбновитьТочкиНаКарте();	
КонецПроцедуры

&НаКлиенте
Процедура ФилиалПриИзменении(Элемент)
	ПриИзмененииДанныхДляДоставки();
КонецПроцедуры

&НаКлиенте
Процедура ВидДоставкиПриИзменении(Элемент)
	ПриИзмененииДанныхДляДоставки();
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьОтборПоТарифамПриИзменении(Элемент)
	ПриИзмененииДанныхДляДоставки();
КонецПроцедуры

&НаКлиенте
Процедура ТипТСПриИзменении(Элемент)
	ПриИзмененииДанныхДляДоставки();
	ДостуностьТаблицыЗаказов();
КонецПроцедуры

&НаКлиенте
Процедура ПериодПриИзменении(Элемент)
	ПриИзмененииДанныхДляДоставки();
КонецПроцедуры

&НаКлиенте
Процедура ВремяДоставкиСПриИзменении(Элемент)
	ПриИзмененииДанныхДляДоставки();
КонецПроцедуры

&НаКлиенте
Процедура ВремяДоставкиПоПриИзменении(Элемент)
	ПриИзмененииДанныхДляДоставки();
КонецПроцедуры

&НаКлиенте
Процедура КартаПриИзменении(Элемент)
	УстановитьВидимостьДоступность();
КонецПроцедуры
#КонецОбласти

#Область КомандыИСобытия
&НаКлиенте
Процедура ОтборПоТарифам(Команда)
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("РежимВыбора",Истина);
	ПараметрыФормы.Вставить("МножественныйВыбор",Истина);
	ПараметрыФормы.Вставить("ВыделитьСтрокиМассив", ПолучитьМассивТарифов());
	
	ОбработкаВыбора = Новый ОписаниеОповещения("ПриЗакрытииФормыВыбораТарифов", ЭтаФорма);

	ОткрытьФорму("Справочник.ТарифыПеревозчиков.Форма.ФормаВыбора",ПараметрыФормы,ЭтаФорма, , , , ОбработкаВыбора);
КонецПроцедуры

&НаСервере
Функция ПолучитьМассивТарифов()
	Возврат Тарифы.Выгрузить().ВыгрузитьКолонку("Тариф");
КонецФункции

&НаКлиенте
Процедура ПриЗакрытииФормыВыбораТарифов(МассивТарифов, ДопПараметры) Экспорт
	Если МассивТарифов <> Неопределено Тогда
		Тарифы.Очистить();
		
		Для Каждого ЭлементМассива Из МассивТарифов Цикл
			НоваяСтрока = Тарифы.Добавить();
			НоваяСтрока.Тариф = ЭлементМассива;
		КонецЦикла;
		
		Если ИспользоватьОтборПоТарифам Тогда 
			ПриИзмененииДанныхДляДоставки();
		КонецЕсли;
    КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСписокДоставки(Команда)
	ПриИзмененииДанныхДляДоставки();
КонецПроцедуры
&НаСервере
Процедура ОбновитьСписокДоставкиНаСервере()
	ЗаказыВРейс.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РегистрНакопленияЗаказыКДоставкеОстатки.ЗаказНаДоставку КАК ЗаказНаДоставку,
		|	СУММА(РегистрНакопленияЗаказыКДоставкеОстатки.КоличествоОстаток) КАК КоличествоОстаток
		|ПОМЕСТИТЬ ВТ_ЗаказыКДоставке
		|ИЗ
		|	РегистрНакопления.ЗаказыКДоставке.Остатки КАК РегистрНакопленияЗаказыКДоставкеОстатки
		|ГДЕ
		|	РегистрНакопленияЗаказыКДоставкеОстатки.КоличествоОстаток > 0
		|
		|СГРУППИРОВАТЬ ПО
		|	РегистрНакопленияЗаказыКДоставкеОстатки.ЗаказНаДоставку
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЗапасыИПотребностиОстатки.Назначение КАК Назначение,
		|	ЗапасыИПотребностиОстатки.Назначение.Заказ КАК НазначениеЗаказ
		|ПОМЕСТИТЬ ВТ_ЗаказыПодНазначение
		|ИЗ
		|	РегистрНакопления.ЗапасыИПотребности.Остатки(, Назначение <> ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка)) КАК ЗапасыИПотребностиОстатки
		|ГДЕ
		|	ЗапасыИПотребностиОстатки.КОбеспечениюОстаток + ЗапасыИПотребностиОстатки.РезервироватьПоМереПоступленияОстаток + ЗапасыИПотребностиОстатки.ОтложитьРезервированиеОстаток + ЗапасыИПотребностиОстатки.РезервироватьНаСкладеОстаток = ЗапасыИПотребностиОстатки.ПоступитОстаток
		|
		|СГРУППИРОВАТЬ ПО
		|	ЗапасыИПотребностиОстатки.Назначение,
		|	ЗапасыИПотребностиОстатки.Назначение.Заказ
		|;
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЗаказНаДоставкуКлиентуОснования.Документ КАК ДокументПродажи,
		|	ЗаказНаДоставкуКлиентуОснования.Ссылка КАК ЗаказНаДоставку,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(ЗаказНаДоставкуКлиентуОснования.Документ.Кассир.Ссылка, 0) = 0
		|			ТОГДА 0
		|		ИНАЧЕ 1
		|	КОНЕЦ КАК ОтметкаКассы,
		|	НЕОПРЕДЕЛЕНО КАК ПодНазначение
		|ПОМЕСТИТЬ ВТ_ОтметкаКассы
		|ИЗ
		|	Документ.ЗаказНаДоставкуКлиенту.Основания КАК ЗаказНаДоставкуКлиентуОснования
		|ГДЕ
		|	ЗаказНаДоставкуКлиентуОснования.Ссылка В
		|			(ВЫБРАТЬ
		|				ВТ_ЗаказыКДоставке.ЗаказНаДоставку КАК ЗаказНаДоставку
		|			ИЗ
		|				ВТ_ЗаказыКДоставке КАК ВТ_ЗаказыКДоставке)
		|	И ЗаказНаДоставкуКлиентуОснования.Документ ССЫЛКА Документ.РеализацияТоваровУслуг
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЗаказНаДоставкуКлиентуОснования.Документ,
		|	ЗаказНаДоставкуКлиентуОснования.Ссылка,
		|	ВЫБОР
		|		КОГДА ЗаказНаДоставкуКлиентуОснования.Документ.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыЧековККМ.Пробит)
		|			ТОГДА 1
		|		ИНАЧЕ 0
		|	КОНЕЦ,
		|	НЕОПРЕДЕЛЕНО
		|ИЗ
		|	Документ.ЗаказНаДоставкуКлиенту.Основания КАК ЗаказНаДоставкуКлиентуОснования
		|ГДЕ
		|	ЗаказНаДоставкуКлиентуОснования.Ссылка В
		|			(ВЫБРАТЬ
		|				ВТ_ЗаказыКДоставке.ЗаказНаДоставку КАК ЗаказНаДоставку
		|			ИЗ
		|				ВТ_ЗаказыКДоставке КАК ВТ_ЗаказыКДоставке)
		|	И ЗаказНаДоставкуКлиентуОснования.Документ ССЫЛКА Документ.ЧекККМ
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЗаказНаДоставкуКлиентуОснования.Документ,
		|	ЗаказНаДоставкуКлиентуОснования.Ссылка,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(РеализацияТоваровУслуг.Кассир.Ссылка, 0) = 0
		|			ТОГДА 0
		|		ИНАЧЕ 1
		|	КОНЕЦ,
		|	ЕСТЬNULL(ВТ_ЗаказыПодНазначение.Назначение, НЕОПРЕДЕЛЕНО)
		|ИЗ
		|	Документ.ЗаказНаДоставкуКлиенту.Основания КАК ЗаказНаДоставкуКлиентуОснования
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
		|		ПО ЗаказНаДоставкуКлиентуОснования.Документ = РеализацияТоваровУслуг.ЗаказКлиента
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ЗаказыПодНазначение КАК ВТ_ЗаказыПодНазначение
		|		ПО ЗаказНаДоставкуКлиентуОснования.Документ = ВТ_ЗаказыПодНазначение.НазначениеЗаказ
		|ГДЕ
		|	ЗаказНаДоставкуКлиентуОснования.Ссылка В
		|			(ВЫБРАТЬ
		|				ВТ_ЗаказыКДоставке.ЗаказНаДоставку КАК ЗаказНаДоставку
		|			ИЗ
		|				ВТ_ЗаказыКДоставке КАК ВТ_ЗаказыКДоставке)
		|	И ЗаказНаДоставкуКлиентуОснования.Документ ССЫЛКА Документ.ЗаказКлиента
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ОтметкаКассы.ЗаказНаДоставку КАК ЗаказНаДоставку,
		|	МИНИМУМ(ВТ_ОтметкаКассы.ОтметкаКассы) КАК ОтметкаКассы,
		|	ВТ_ОтметкаКассы.ПодНазначение КАК ПодНазначение
		|ПОМЕСТИТЬ ВТ_ОтметкаКассыОбъединение
		|ИЗ
		|	ВТ_ОтметкаКассы КАК ВТ_ОтметкаКассы
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_ОтметкаКассы.ЗаказНаДоставку,
		|	ВТ_ОтметкаКассы.ПодНазначение
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СУММА(ИтогРеализацииИЧеки.КоличествоДокументовПродажи) КАК КоличествоДокументовПродажи,
		|	ИтогРеализацииИЧеки.ЗаказНаДоставку КАК ЗаказНаДоставку
		|ПОМЕСТИТЬ ВТ_РеализацииИЧеки
		|ИЗ
		|	(ВЫБРАТЬ
		|		КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВТ_ОтметкаКассы.ДокументПродажи) КАК КоличествоДокументовПродажи,
		|		ВТ_ОтметкаКассы.ЗаказНаДоставку КАК ЗаказНаДоставку
		|	ИЗ
		|		ВТ_ОтметкаКассы КАК ВТ_ОтметкаКассы
		|	ГДЕ
		|		ВТ_ОтметкаКассы.ДокументПродажи ССЫЛКА Документ.РеализацияТоваровУслуг
		|	
		|	СГРУППИРОВАТЬ ПО
		|		ВТ_ОтметкаКассы.ЗаказНаДоставку
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВТ_ОтметкаКассы.ДокументПродажи),
		|		ВТ_ОтметкаКассы.ЗаказНаДоставку
		|	ИЗ
		|		ВТ_ОтметкаКассы КАК ВТ_ОтметкаКассы
		|	ГДЕ
		|		ВТ_ОтметкаКассы.ДокументПродажи ССЫЛКА Документ.ЧекККМ
		|	
		|	СГРУППИРОВАТЬ ПО
		|		ВТ_ОтметкаКассы.ЗаказНаДоставку
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВТ_ОтметкаКассы.ДокументПродажи),
		|		ВТ_ОтметкаКассы.ЗаказНаДоставку
		|	ИЗ
		|		(ВЫБРАТЬ
		|			ВТ_ОтметкаКассы_Заказ.ДокументПродажи КАК ДокументПродажи,
		|			ВТ_ОтметкаКассы_Заказ.ЗаказНаДоставку КАК ЗаказНаДоставку
		|		ИЗ
		|			ВТ_ОтметкаКассы КАК ВТ_ОтметкаКассы_Заказ
		|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК Реализация
		|				ПО ВТ_ОтметкаКассы_Заказ.ДокументПродажи = Реализация.Ссылка.ЗаказКлиента
		|		ГДЕ
		|			ВТ_ОтметкаКассы_Заказ.ДокументПродажи ССЫЛКА Документ.ЗаказКлиента) КАК ВТ_ОтметкаКассы
		|	
		|	СГРУППИРОВАТЬ ПО
		|		ВТ_ОтметкаКассы.ЗаказНаДоставку) КАК ИтогРеализацииИЧеки
		|
		|СГРУППИРОВАТЬ ПО
		|	ИтогРеализацииИЧеки.ЗаказНаДоставку
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЗаказНаДоставкуКлиентуОснования.Ссылка КАК Ссылка,
		|	ИСТИНА КАК ЕстьОснование
		|ПОМЕСТИТЬ ВТ_ЗаказыСОбращениемВОсновании
		|ИЗ
		|	Документ.ЗаказНаДоставкуКлиенту.Основания КАК ЗаказНаДоставкуКлиентуОснования
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ОбращениеКлиента КАК ОбращениеКлиента
		|		ПО ЗаказНаДоставкуКлиентуОснования.Документ = ОбращениеКлиента.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ЗаказНаДоставкуКлиенту.ТипТС КАК ТипТС, 
		|	ЗаказНаДоставкуКлиенту.ТипТС.Приоритет КАК ПриоритетТипаТС, 
		|	ЗаказНаДоставкуКлиенту.ПрибытиеНаОтгрузку КАК ПрибытиеНаОтгрузку,
		|	ЗаказНаДоставкуКлиенту.ВремяДоставкиС КАК ВремяДоставкиС,
		|	ЗаказНаДоставкуКлиенту.ВремяДоставкиПо КАК ВремяДоставкиПо,
		|	ЗаказНаДоставкуКлиенту.Вес КАК Вес,
		|	ЗаказНаДоставкуКлиенту.Объем КАК Объем,
		|	ЗаказНаДоставкуКлиенту.АдресДоставки КАК АдресДоставки,
		|	ЗаказНаДоставкуКлиенту.Широта КАК Широта,	
		|	ЗаказНаДоставкуКлиенту.Долгота КАК Долгота,		
		|	ЗаказНаДоставкуКлиенту.Ссылка КАК ЗаказНаДоставку,
		|	ЗаказНаДоставкуКлиенту.СуммаДокумента КАК Выручка,
		|	ЗаказНаДоставкуКлиенту.Партнер КАК Клиент,
		|	ЗаказНаДоставкуКлиенту.ТелефонКлиента КАК Телефон,
		|	ЗаказНаДоставкуКлиенту.ТелефонКлиентаНаВыгрузке КАК ТелефонНаВыгрузки,
		|	ЗаказНаДоставкуКлиенту.СтоимостьДоставки КАК ТранспортныеРасходы,
		|	ЗаказНаДоставкуКлиенту.Номер КАК Номер,
		|	ЗаказНаДоставкуКлиенту.Дата КАК Дата,
		|	ЗаказНаДоставкуКлиенту.Подразделение КАК Подразделение,
		|	ЗаказНаДоставкуКлиенту.ЭкспрессДоставка КАК ЭкспрессДоставка,
		|	ЗаказНаДоставкуКлиенту.ССайта КАК ССайта,
		|	ЗаказНаДоставкуКлиенту.Организация КАК Организация,
		|	ЗаказНаДоставкуКлиенту.ДоставкаСРазгрузкой КАК ДоставкаСРазгрузкой,
		|	ЗаказНаДоставкуКлиенту.СтоимостьДоставки КАК СтоимостьДоставки,
		|	ЗаказНаДоставкуКлиенту.СтоимостьДоставкиСНДС КАК СтоимостьДоставкиСНДС,
		|	ЗаказНаДоставкуКлиенту.ВидРазгрузки КАК ВидРазгрузки,
		|	ЗаказНаДоставкуКлиенту.МаксимальнаяДлина КАК МаксимальнаяДлина,
		|	ЗаказНаДоставкуКлиенту.ВидДоставки КАК ВидДоставки,
		|	ЗаказНаДоставкуКлиенту.НужнаИнкассация КАК НужнаИнкассация,
		|	ЗаказНаДоставкуКлиенту.НаправлениеДоставки КАК НаправлениеДоставки,
		|	ВЫБОР
		|		КОГДА ЗаказНаДоставкуКлиенту.Объем <> 0
		|			ТОГДА ЗаказНаДоставкуКлиенту.Вес / ЗаказНаДоставкуКлиенту.Объем
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК ВесКОбъему,
		|	ЗаказНаДоставкуКлиенту.Инкассация КАК СуммаИнкассации,
		|	ЕСТЬNULL(ВТ_ОтметкаКассы.ОтметкаКассы, 0) КАК ОтметкаКассы,
		|	ВТ_ЗаказыКДоставке.ЗаказНаДоставку.Инкассация КАК Инкассация,
		|	ЕСТЬNULL(ВТ_РеализацииИЧеки.КоличествоДокументовПродажи, 0) КАК КоличествоДокументовПродажи,
		|	ВТ_ЗаказыКДоставке.ЗаказНаДоставку.ОплатаБанковскойКартой КАК ОплатаБанковскойКартой,
		|	ВТ_ОтметкаКассы.ПодНазначение КАК ПодНазначение,
		|	ЗаказНаДоставкуКлиенту.ЕстьЗаявкаЛесЕГАИС КАК ЕстьЗаявкаЛесЕГАИС,
		|	ЗаказНаДоставкуКлиенту.Тариф КАК Тариф,
		|	ЗаказНаДоставкуКлиенту.Тариф.ГрузоподъемностьВТоннах КАК ТарифГрузоподъемностьВТоннах,
		|	ЕСТЬNULL(ВТ_ЗаказыСОбращениемВОсновании.ЕстьОснование, ЛОЖЬ) КАК ОбменДовозПоОбращению
		|ИЗ
		|	ВТ_ЗаказыКДоставке КАК ВТ_ЗаказыКДоставке
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказНаДоставкуКлиенту КАК ЗаказНаДоставкуКлиенту
		|		ПО ВТ_ЗаказыКДоставке.ЗаказНаДоставку = ЗаказНаДоставкуКлиенту.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ОтметкаКассыОбъединение КАК ВТ_ОтметкаКассы
		|		ПО ВТ_ЗаказыКДоставке.ЗаказНаДоставку = ВТ_ОтметкаКассы.ЗаказНаДоставку
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_РеализацииИЧеки КАК ВТ_РеализацииИЧеки
		|		ПО ВТ_ЗаказыКДоставке.ЗаказНаДоставку = ВТ_РеализацииИЧеки.ЗаказНаДоставку
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ЗаказыСОбращениемВОсновании КАК ВТ_ЗаказыСОбращениемВОсновании
		|		ПО (ВТ_ЗаказыКДоставке.ЗаказНаДоставку = ВТ_ЗаказыСОбращениемВОсновании.Ссылка)
		|ГДЕ
		|	ИСТИНА
		|	И ЗаказНаДоставкуКлиенту.Подразделение = &Подразделение
		|	И (ЗаказНаДоставкуКлиенту.ПрибытиеНаОтгрузку < &Период
		|			ИЛИ ЗаказНаДоставкуКлиенту.ПрибытиеНаОтгрузку = &Период
		|				И (ЗаказНаДоставкуКлиенту.ВремяДоставкиС >= &ДатаС
		|						И ЗаказНаДоставкуКлиенту.ВремяДоставкиПо <= &ДатаПо
		|					ИЛИ РАЗНОСТЬДАТ(&ДатаС, &ДатаПо, ЧАС) >= &ИнтервалПересеченияВЧасах
		|						И РАЗНОСТЬДАТ(ЗаказНаДоставкуКлиенту.ВремяДоставкиС, ЗаказНаДоставкуКлиенту.ВремяДоставкиПо, ЧАС) >= &ИнтервалПересеченияВЧасах
		|						И (РАЗНОСТЬДАТ(ЗаказНаДоставкуКлиенту.ВремяДоставкиС, &ДатаПо, ЧАС) >= &ИнтервалПересеченияВЧасах
		|								И ЗаказНаДоставкуКлиенту.ВремяДоставкиПо >= &ДатаПо
		|							ИЛИ РАЗНОСТЬДАТ(&ДатаС, ЗаказНаДоставкуКлиенту.ВремяДоставкиПо, ЧАС) >= &ИнтервалПересеченияВЧасах
		|								И &ДатаПо >= ЗаказНаДоставкуКлиенту.ВремяДоставкиПо)))
		|	И ЗаказНаДоставкуКлиенту.ВидДоставки В(&мВидДоставки)
		|	И ЗаказНаДоставкуКлиенту.Тариф В(&Тарифы)
		|	И &УсловиеПоТипуТС
		|
		|УПОРЯДОЧИТЬ ПО
		|	ЭкспрессДоставка УБЫВ,
		|	ПрибытиеНаОтгрузку,
		|	ВремяДоставкиС";
	
	Если Не ЗначениеЗаполнено(Период) Тогда
		Период = ТекущаяДата();
	КонецЕсли;
	Запрос.УстановитьПараметр("Период", Период);
	Запрос.УстановитьПараметр("ИнтервалПересеченияВЧасах", 2);
	
	Если ВремяДоставкиС > ВремяДоставкиПо И ЗначениеЗаполнено(ВремяДоставкиС) И ЗначениеЗаполнено(ВремяДоставкиПо) Тогда
		Запрос.УстановитьПараметр("ДатаС", Дата(1, 1, 1));
		Запрос.УстановитьПараметр("ДатаПо", Дата(1, 1, 1, 23, 59, 59));
		ОбщегоНазначения.СообщитьПользователю("Время доставки 'С' больше, чем время доставки 'По'! Будут выведены заказы за весь день");
	Иначе
		Запрос.УстановитьПараметр("ДатаС", ВремяДоставкиС);
		Если ЗначениеЗаполнено(ВремяДоставкиПо) Тогда
			Запрос.УстановитьПараметр("ДатаПо", ВремяДоставкиПо);
		Иначе
			Запрос.УстановитьПараметр("ДатаПо", Дата(1, 1, 1, 23, 59, 59));
		КонецЕсли;
	КонецЕсли;
	
	Если ИспользоватьОтборПоТарифам Тогда
		Запрос.УстановитьПараметр("Тарифы", Тарифы.Выгрузить().ВыгрузитьКолонку("Тариф"));
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И ЗаказНаДоставкуКлиенту.Тариф В(&Тарифы)", "");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Филиал) Тогда
		Запрос.УстановитьПараметр("Подразделение", Филиал);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И ЗаказНаДоставкуКлиенту.Подразделение = &Подразделение", "");
	КонецЕсли;
	                                                   
	Если ЗначениеЗаполнено(ВидДоставки) Тогда
		мВидДоставки = Новый Массив;
		мВидДоставки.Добавить(ВидДоставки);
		Если ВидДоставки = Перечисления.ВидыДоставокДоКлиента.Розничная Тогда
			мВидДоставки.Добавить(Перечисления.ВидыДоставокДоКлиента.Внутренняя);
		КонецЕсли;
		Запрос.УстановитьПараметр("мВидДоставки", мВидДоставки);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И ЗаказНаДоставкуКлиенту.ВидДоставки В(&мВидДоставки)", "");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТипТС) Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеПоТипуТС", "Вес <= &ВесMax И Объем <= &ОбъемMax И (ЗаказНаДоставкуКлиенту.ТипТС = Значение(Справочник.ТипыТранспортныхСредств.ПустаяСсылка) ИЛИ ЗаказНаДоставкуКлиенту.ТипТС.Приоритет <= &ПриоритетТС)");
		
		Запрос.УстановитьПараметр("ПриоритетТС", ТипТС.Приоритет); 	
		Запрос.УстановитьПараметр("ВесMax", ТипТС.ГрузоподъемностьВТоннах * 1000);
		Запрос.УстановитьПараметр("ОбъемMax", ТипТС.ВместимостьВКубическихМетрах);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеПоТипуТС", "Истина");
	КонецЕсли;
	
	РезультатЗапроса = Запрос.Выполнить();
	ПулЗаказов.Загрузить(РезультатЗапроса.Выгрузить());
	
	Если ВидДоставки = Перечисления.ВидыДоставокДоКлиента.Розничная Тогда
		Выборка = Документы.ЗаказНаДоставкуКлиенту.ПолучитьКоличествоЗаказовНаДоставку(ТекущаяДата(), Филиал);
		сч = 1;
		Пока Выборка.Следующий() Цикл
			ИмяЭлемента = "Интервал" + сч;
			Если Элементы.Найти(ИмяЭлемента) = Неопределено Тогда
				Элементы.Добавить(ИмяЭлемента, Тип("ДекорацияФормы"), Элементы.ГруппаИнтервалы);
			КонецЕсли;
			Элементы[ИмяЭлемента].Заголовок = Выборка.Наименование + ": " + Выборка.КолЗаказов;
			сч = сч + 1;
		КонецЦикла;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТипТС) Тогда
		мУдалитьСтроки = Новый Массив;
		
		мСкрытьЗаказы = УправлениеЛогистикойСервер.МассивНесовместимыхТиповТСДляРабочегоМестаМенеджераПоДоставке(
			ТипТС,
			ПулЗаказов.Выгрузить( , "ЗаказНаДоставку").ВыгрузитьКолонку(0));
			
		Если ЗначениеЗаполнено(мСкрытьЗаказы) Тогда
			Для Каждого Строка Из ПулЗаказов Цикл
				Если мСкрытьЗаказы.Найти(Строка.ЗаказНаДоставку) <> Неопределено Тогда                                              
					мУдалитьСтроки.Добавить(Строка);
				КонецЕсли;
			КонецЦикла;
			
			Для Каждого Строка Из мУдалитьСтроки Цикл
				ПулЗаказов.Удалить(Строка);
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ФункцииОбработки

&НаКлиенте
Процедура ПулЗаказовВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка= Ложь;
	Док= Элементы.ПулЗаказов.ТекущиеДанные.ЗаказНаДоставку;
	Если Не Док.Пустая() Тогда 	
		ОткрытьФорму("Документ.ЗаказНаДоставкуКлиенту.ФормаОбъекта", Новый Структура("Ключ", Док));
	КонецЕсли;
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьМассивОснования(Ссылка)
	мОснований = Новый Массив;
	Для Каждого стрОснования Из Ссылка.Основания Цикл
		мОснований.Добавить(стрОснования.Документ);
	КонецЦикла;
	Возврат мОснований;
КонецФункции

&НаКлиенте
Процедура РасчитатьИтоги()
	Ном= 1;
	ВесИтог= 0;
	ОбъемИтог= 0;
	МаксимальнаяДлинна= 0;
	Расстояние= 0;
	ВремяВПути= 0;
	ВремяРазгрузки= 0;
	СтоимостьДоставки= 0;
	СтоимостьДоставкиСНДС= 0;
	Для Каждого стрДоставки Из ЗаказыВРейс Цикл
		стрДоставки.НомерСтроки= Ном;
		Ном= Ном+1;
		ВесИтог= ВесИтог+стрДоставки.Вес;
		ОбъемИтог= ОбъемИтог+стрДоставки.Объем;
		МаксимальнаяДлинна= Макс(МаксимальнаяДлинна, стрДоставки.МаксимальнаяДлина);
		Расстояние= Расстояние+стрДоставки.Расстояние;
		ВремяВПути= ВремяВПути+стрДоставки.ВремяВПути;
		ВремяРазгрузки= ВремяРазгрузки+стрДоставки.ВремяРазгрузки;
		СтоимостьДоставки= СтоимостьДоставки+стрДоставки.СтоимостьДоставки;
		СтоимостьДоставкиСНДС= СтоимостьДоставкиСНДС+стрДоставки.СтоимостьДоставкиСНДС;
	КонецЦикла;
	Элементы.ЗаказыВРейсыВес.ТекстПодвала= ВесИтог;
	Элементы.ЗаказыВРейсыОбъем.ТекстПодвала= ОбъемИтог;
	Элементы.ЗаказыВРейсыМаксимальнаяДлина.ТекстПодвала= МаксимальнаяДлинна;
	Элементы.ЗаказыВРейсыРасстояние.ТекстПодвала= Расстояние;
	Элементы.ЗаказыВРейсыВремяВПути.ТекстПодвала= ВремяВПути;
	Элементы.ЗаказыВРейсыВремяРазгрузки.ТекстПодвала= ВремяРазгрузки;
	Элементы.ЗаказыВРейсСтоимостьДоставки.ТекстПодвала= СтоимостьДоставки;
	Элементы.ЗаказыВРейсСтоимостьДоставкиСНДС.ТекстПодвала= СтоимостьДоставкиСНДС;
КонецПроцедуры

&НаСервере
Процедура СкрытьНесовместимыеЗаказы()  
	Если ЗначениеЗаполнено(ТипТС) Тогда
		мУдалитьСтроки = Новый Массив;
		
		// Несовместимость по критерям для типов ТС
		мСкрытьЗаказы = УправлениеЛогистикойСервер.СкрытьНесовместимыеЗаказы(
			ТипТС,
			ЗаказыВРейс.Выгрузить( , "ЗаказНаДоставку").ВыгрузитьКолонку(0),
			ПулЗаказов.Выгрузить( , "ЗаказНаДоставку").ВыгрузитьКолонку(0));			
		
		// Несовместимость по весу и по объему
		ВесMax = ТипТС.ГрузоподъемностьВТоннах * 1000 - ЗаказыВРейс.Итог("Вес");
		ОбъемMax = ТипТС.ВместимостьВКубическихМетрах - ЗаказыВРейс.Итог("Объем");
		
		Для Каждого Строка Из ПулЗаказов Цикл
			Если Строка.Вес > ВесMax ИЛИ Строка.Объем > ОбъемMax ИЛИ                // проверка по весу и объему 
				мСкрытьЗаказы.Найти(Строка.ЗаказНаДоставку) <> Неопределено ИЛИ    // проверка по критерям
				Строка.Отметка Тогда                                              // скрываем также отмеченные
				
				мУдалитьСтроки.Добавить(Строка);
			КонецЕсли;
		КонецЦикла;
		
		Для Каждого Строка Из мУдалитьСтроки Цикл
			ПулЗаказов.Удалить(Строка);
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьУдалитьЗаказВРейс()
	ТекущаяСтрока = Элементы.ПулЗаказов.ТекущиеДанные;	
	Если ТекущаяСтрока <> Неопределено Тогда
		Если ТекущаяСтрока.Отметка Тогда	
			НоваяСтрока = ЗаказыВРейс.Добавить();   
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекущаяСтрока);
			НоваяСтрока.НомерСтроки = ЗаказыВРейс.Количество();
		Иначе
			Строки = ЗаказыВРейс.НайтиСтроки(Новый Структура ("ЗаказНаДоставку", ТекущаяСтрока.ЗаказНаДоставку));
			Для Каждого Строка Из Строки Цикл
				ЗаказыВРейс.Удалить(ЗаказыВРейс.Индекс(Строка));
			КонецЦикла;	
		КонецЕсли;
		
		СкрытьНесовместимыеЗаказы();
		РасчитатьИтоги();
		ОбновитьТочкиНаКарте();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимостьДоступность()
	Если ВидДоставки = ПредопределенноеЗначение("Перечисление.ВидыДоставокДоКлиента.Розничная") Тогда
		Элементы.ДокументыДоставкиНаправлениеДоставки.Видимость= Ложь;
		Элементы.ГруппаИнтервалы.Видимость= Истина;
	Иначе 
		Элементы.ДокументыДоставкиНаправлениеДоставки.Видимость= Истина;
		Элементы.ГруппаИнтервалы.Видимость= Ложь;
	КонецЕсли;
	
	Если Карта Тогда 
		Элементы.ГруппаПраво.Видимость= Истина;
		Элементы.ЗаказыВРейсПостроитьМаршрутRoute.Видимость= Истина;
	Иначе
		Элементы.ГруппаПраво.Видимость= Ложь;
		Элементы.ЗаказыВРейсПостроитьМаршрутRoute.Видимость= Ложь;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОформитьДокументы

&НаКлиенте
Процедура СоздатьРейс(Команда)
	Если СуществуютДублиСкладов() Тогда
		Возврат;
	КонецЕсли;
	
	СоздатьРейсНаКлиенте();
	СброситьТС(); 
	ПриИзмененииДанныхДляДоставки();
	ДостуностьТаблицыЗаказов();
КонецПроцедуры 

&НаСервере
Процедура СброситьТС() 
	ТипТС = Справочники.ТипыТранспортныхСредств.ПустаяСсылка();
КонецПроцедуры 

&НаСервере
Функция СуществуютДублиСкладов()
	Возврат Документы.ЗаданиеНаПеревозкуРейс.ПроверитьДублиСкладОтправитьСкладПолучатель(ЗаказыВРейс.Выгрузить( , "ЗаказНаДоставку").ВыгрузитьКолонку(0));
КонецФункции

&НаКлиенте
Процедура СоздатьРейсНаКлиенте()
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Основание", МассивЗаказовВРейс());
	ПараметрыФормы.Вставить("ВызовИзОбработкиРабочееМестоМенеджераПоДоставке", Истина);
	
	ОткрытьФорму("Документ.ЗаданиеНаПеревозкуРейс.ФормаОбъекта", ПараметрыФормы, ЭтаФорма);
КонецПроцедуры

&НаСервере
Функция МассивЗаказовВРейс()
	Массив = РеквизитФормыВЗначение("ЗаказыВРейс").ВыгрузитьКолонку("ЗаказНаДоставку");
	Документы.ЗаданиеНаПеревозкуРейс.ИзменениеСтатусовДляДокументовОснований(Массив, Перечисления.СтатусыЗаказовНаДоставку.ВРейсе);            
	Возврат Массив;
КонецФункции

&НаКлиенте
Процедура ЗаказыВРейсыПриИзменении(Элемент)
	РасчитатьИтоги();
КонецПроцедуры
#КонецОбласти

#Область КАРТА
#Область СобытияКарты
&НаКлиенте
Процедура КомандаОбновитьТочкиНаКарте(Команда)
	ОбновитьТочкиНаКарте();
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьТочкиНаКарте()
	Если Карта Тогда
		ИнициализироватьКартуНаСервере();
		ОчиститьКарту();
		ПодключитьОбработчикОжидания("ОбработчикОжидания", 1, Истина);
	КонецЕсли;
КонецПроцедуры
&НаКлиенте
Процедура ОбработчикОжидания() Экспорт
	Для Каждого стрЗаказа Из ПулЗаказов Цикл
		ДобавитьТочкуНаКарту(стрЗаказа.АдресДоставки, стрЗаказа.Широта, стрЗаказа.Долгота);
	КонецЦикла;
	
	Для Каждого стрЗаказа Из ЗаказыВРейс Цикл
		ДобавитьТочкуНаКарту(стрЗаказа.АдресДоставки, стрЗаказа.Широта, стрЗаказа.Долгота);
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура КомандаОчиститьКарту(Команда)
	ОчиститьКарту();
КонецПроцедуры
	
&НаКлиенте
Процедура ОчиститьКарту()
	КартаДокумент = Элементы.КартаЯндекс.Документ;
	Если КартаДокумент <> Неопределено Тогда
		КартаДокумент.defaultView.initMap();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПостроитьМаршрутRoute(Команда)
	Попытка
		КартаДокумент = Элементы.КартаЯндекс.Документ;
		Если КартаДокумент <> Неопределено Тогда
			КартаДокумент.defaultView.calcRouter();
		КонецЕсли;
	Исключение
		Сообщить("Ошибка сервияса геокодирования Яндекс");
	КонецПопытки;
КонецПроцедуры

#КонецОбласти

#Область ИнициализацияКарты
&НаСервере
Процедура ИнициализироватьКартуНаСервере()
	Парам= Обработки.КартографическийИнтерфейсДоставка.ПолучитьСтруктуруПараметров();
	Парам.Вставить("ВидДоставки", ВидДоставки);
	Парам.Вставить("Филиал", Филиал);

	Обработки.КартографическийИнтерфейсДоставка.ИнициализироватьКартуТолькоЗоны(КартаЯндекс, Парам);
КонецПроцедуры
#КонецОбласти

#Область Геокодирование
&НаКлиентеНаСервере
Функция ПолучитьДанныеСКарты(ПеременныеКарты)
	ДанныеКарты= Новый Структура;
	ДанныеКарты.Вставить("Адрес", ПеременныеКарты.Address);
	ДанныеКарты.Вставить("РасчетПоРасстоянию", ПеременныеКарты.distanceCalc);
	ДанныеКарты.Вставить("СтоимостьПоРасстоянию", ПеременныеКарты.distanseCost);
	ДанныеКарты.Вставить("СтоимостьДоставки", ПеременныеКарты.price);
	ДанныеКарты.Вставить("Зона", ПеременныеКарты.zone);
КонецФункции

&НаКлиенте
Процедура ДобавитьТочкуНаКарту(АдресДоставки, Широта = 0, Долгота = 0)
	КартаДокумент = Элементы.КартаЯндекс.Документ;
	Если КартаДокумент <> Неопределено Тогда
		Если Широта <>  0 Тогда 
			КартаДокумент.defaultView.addMarkerOnCoords(Широта, Долгота, АдресДоставки);
		Иначе
			КартаДокумент.defaultView.addMarkerOnAdress(АдресДоставки);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СоздатьРеализацию(Команда)
	ТекущаяСтрока=Элементы.ПулЗаказов.ТекущиеДанные;
	если ТекущаяСтрока<>Неопределено тогда
		если значениезаполнено(ТекущаяСтрока.ПодНазначение) тогда	
			СоздатьРеализациюСервер(ТекущаяСтрока.ПодНазначение);	
		иначе
			Сообщить("Документ основания не является обособленным. Создание реализации не требуется.");
		конецесли;
	конецесли;	
КонецПроцедуры

Процедура СоздатьРеализациюСервер(Назначение)
	УстановитьПривилегированныйРежим(истина);
	
	НачатьТранзакцию();
	
		ЗаказКлиента= Назначение.Заказ;
		
		Если Не ЗначениеЗаполнено(ЗаказКлиента.Кассир) Тогда
			Сообщить("На документ "+ЗаказКлиента+"не установлена отметка кассы.");
			возврат;
		КонецЕсли;
		
		ЗаказОбъект= ЗаказКлиента.ПолучитьОбъект();
		Для Каждого стрТовар Из ЗаказОбъект.Товары Цикл
			Если стрТовар.Отменено Тогда
				Продолжить;
			КонецЕсли;
			
			Если стрТовар.ВариантОбеспечения= Перечисления.ВариантыОбеспечения.УдалитьОтгрузитьОбособленно ИЛИ стрТовар.ВариантОбеспечения= Перечисления.ВариантыОбеспечения.НеТребуется Тогда
				Продолжить;
			КонецЕсли;
			
			Если стрТовар.ВариантОбеспечения= Перечисления.ВариантыОбеспечения.КОбеспечению Тогда
				стрТовар.ВариантОбеспечения= Перечисления.ВариантыОбеспечения.УдалитьОтгрузитьОбособленно;
			Иначе
				стрТовар.ВариантОбеспечения= Перечисления.ВариантыОбеспечения.Отгрузить;
			КонецЕсли;
		КонецЦикла;
		Отказ=ложь;
		Попытка
			ЗаказОбъект.ДополнительныеСвойства.Вставить("Регламент", Истина);
			
			ЗаказОбъект.Записать(РежимЗаписиДокумента.Проведение);
			АльтерраОбщегоНазначения.СообщитьПользователю(ЗаказОбъект.Ссылка, "Отгружен: "+ЗаказОбъект.Ссылка);
		Исключение
			Отказ= Истина;
			Текст= "Не удалось записать: "+ЗаказОбъект.Ссылка;
			АльтерраОбщегоНазначения.СообщитьПользователю(ЗаказОбъект.Ссылка, Текст);
		КонецПопытки;
		
		Если Не Отказ Тогда
			Док= Документы.РеализацияТоваровУслуг.СоздатьДокумент();
			
			ДанныеЗаполнения= Новый Структура;
			ДанныеЗаполнения.Вставить("ВариантОформленияПродажи", Перечисления.ВариантыОформленияПродажи);
			ДанныеЗаполнения.Вставить("ДокументОснование", ЗаказКлиента);
			ДанныеЗаполнения.Вставить("СкладОтгрузки", Неопределено);
			Док.Заполнить(ДанныеЗаполнения);
			
			Док.Склад= ЗаказКлиента.Склад;
			Док.Комментарий= "Создан автоматически по заказу с отметкой кассы";
			Док.Дата= ТекущаяДата();
			Док.Менеджер= ЗаказКлиента.Менеджер;
			Док.Магазин= ЗаказКлиента.Магазин;
			Если Док.Товары.Количество() > 0 Тогда 
				Попытка
					Док.СкидкиРассчитаны=истина;
					Док.Записать(РежимЗаписиДокумента.Проведение);
					АльтерраОбщегоНазначения.СообщитьПользователю(Док.Ссылка, "Создан: "+Док.Ссылка);
				Исключение
					Отказ= Истина;
					Текст= "Не удалось записать: "+Док.Ссылка;
					АльтерраОбщегоНазначения.СообщитьПользователю(Док.Ссылка, Текст);
				КонецПопытки;
				
				Если Не Отказ Тогда
					НужнаЗаявка= Документы.ЗаявкаВЕГАИСЛес.ПроверкаНаличияЗаявкиНаСоответствующийДокументПродажи(Док.Ссылка);
					
					Если НужнаЗаявка Тогда
						ДокЗаявка= Документы.ЗаявкаВЕГАИСЛес.СоздатьДокумент();
						ДокЗаявка.Дата= ТекущаяДата();
						ДокЗаявка.Заполнить(Док.Ссылка);
						Попытка
							ДокЗаявка.Записать(РежимЗаписиДокумента.Проведение);
							АльтерраОбщегоНазначения.СообщитьПользователю(ДокЗаявка.Ссылка, "Создан: "+ДокЗаявка.Ссылка);
						Исключение
							Отказ= Истина;
							Текст= "Не удалось записать: "+ДокЗаявка.Ссылка;
							АльтерраОбщегоНазначения.СообщитьПользователю(ДокЗаявка.Ссылка, Текст);
						КонецПопытки;
					КонецЕсли;
					
					Если Док.ИспользуетсяДоговор Тогда
						ДокЛистСогласования = Документы.ЛистСогласования.СоздатьДокумент();
						ДокЛистСогласования.Дата = ТекущаяДата();
						ДокЛистСогласования.Заполнить(Док.Ссылка);
						ДокЛистСогласования.ВидОперации = Перечисления.ВидыОперацийЛистовСогласования.СогласованиеОформления;
						ДокЛистСогласования.Проблема = Справочники.Проблемы.НайтиПоКоду("000000016");//Реализация (отсутствие оригинала/некорректное оформление -ПАКЕТ ДОКУМЕНТОВ)
						
						Если Док.Партнер<>Справочники.Партнеры.ПустаяСсылка() и Док.Партнер.ОсновнойМенеджер<>Справочники.Пользователи.ПустаяСсылка() и СтрНайти(Док.Партнер.ОсновнойМенеджер.Наименование, "Сектор выписки")=0 Тогда
							ДокЛистСогласования.ОсновнойМенеджер = Док.Партнер.ОсновнойМенеджер;
						Иначе
							ДокЛистСогласования.ОсновнойМенеджер = Док.ЗаказКлиента.Менеджер;
						КонецЕсли;
						ДокЛистСогласования.Согласовано = Справочники.ПользователиДляСогласованияЛистов.НайтиПоКоду("000000035");//Тупицына Оксана Геннадьевна
						ДокЛистСогласования.Согласован = Истина;
						ДокЛистСогласования.Комментарий = "Создан автоматически по заказу с отметкой кассы";
						Попытка
							ДокЛистСогласования.Записать(РежимЗаписиДокумента.Проведение);
							АльтерраОбщегоНазначения.СообщитьПользователю(ДокЛистСогласования.Ссылка, "Создан: "+ДокЛистСогласования.Ссылка);
						Исключение
							Отказ = Истина;
							Текст = "Не удалось записать: " + ДокЛистСогласования.Ссылка;
							АльтерраОбщегоНазначения.СообщитьПользователю(ДокЛистСогласования.Ссылка, Текст);
						КонецПопытки;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	
	Если Отказ Тогда 
		ОтменитьТранзакцию();
		Текст= "Не удалось установить вариант обеспечение отгрузить: "+ЗаказКлиента;
		АльтерраОбщегоНазначения.СообщитьПользователю(ЗаказКлиента, Текст);
	Иначе
		ЗафиксироватьТранзакцию();
	КонецЕсли;
КонецПроцедуры

#КонецОбласти
#КонецОбласти
